# Core CLI tools
brew "bat"           # Better cat with syntax highlighting
brew "btop"          # Better top/htop
brew "eza"           # Better ls (successor to exa)
brew "fd"            # Better find
brew "fzf"           # Fuzzy finder
brew "jq"            # JSON processor
brew "lsd"           # LSDeluxe - another ls alternative
brew "ncdu"          # Disk usage analyzer
brew "ripgrep"       # Better grep
brew "starship"      # Cross-shell prompt
brew "tokei"         # Code statistics
brew "tree"          # Directory tree
brew "watch"         # Execute command periodically
brew "zoxide"        # Smarter cd

# Shell
brew "fish"          # Friendly Interactive Shell

# Editors
brew "micro"         # Terminal text editor
brew "neovim"        # Vim fork

# Git tools
brew "gh"            # GitHub CLI
brew "git"           # Version control
brew "git-delta"     # Better git diff
brew "git-absorb"    # Automatic fixup commits
brew "lazygit"       # Terminal UI for git
brew "pre-commit"    # Git hooks manager
brew "gitleaks"      # Secret scanner

# Development
brew "direnv"        # Directory-specific env vars
brew "golang-migrate"# Database migrations
brew "golangci-lint" # Go linter
brew "sqlc"          # SQL compiler for Go

# Containers & K8s
brew "dive"          # Docker image explorer
brew "docker-compose"# Docker compose
brew "helm"          # Kubernetes package manager
brew "kubernetes-cli"# kubectl
brew "lazydocker"    # Terminal UI for Docker

# Network & Security
brew "nmap"          # Network scanner
brew "hurl"          # HTTP testing

# Fun
brew "cmatrix"       # Matrix screensaver
brew "figlet"        # ASCII art text
brew "glow"          # Markdown renderer

# Casks (macOS apps)
cask "ghostty"       # Terminal emulator
cask "hiddenbar"     # Menu bar manager
cask "stats"         # System monitor
